In [124]:
import pandas as pd
from openpyxl.styles import PatternFill
from openpyxl.formatting.rule import FormulaRule
users=pd.read_csv("users.csv",index_col=0)
products=pd.read_csv("products.csv",index_col=0)
orders=pd.read_csv("orders.csv",index_col=0)
order_items=pd.read_csv("order_items.csv",index_col=0)
payments=pd.read_csv("payments.csv",index_col=0)

In [58]:
#users dataset
users

                  name                 email      country signup_date
user_id
1             John Doe    john.doe@gmail.com        Kenya  2024-01-05
2           Jane Smith  jane.smith@yahoo.com          USA  2024-01-12
3           Mike Brown                   NaN           UK  2024-02-01
4        Alice Johnson       alice@gmail.com       Canada  2024-02-15
5              Bob Lee     bob.lee@gmail.com        Kenya  2024-03-01
6          Chris Evans       chris@gmail.com          USA  2024-03-02
7          Linda White       linda@yahoo.com           UK  2024-03-03
8           Samuel Kim     sam.kim@gmail.com  South Korea  2024-03-05
9            Raj Patel         raj@gmail.com        India  2024-03-06
10         Maria Lopez       maria@yahoo.com        Spain  2024-03-07

In [2]:
#check for missing values in users dataset
users.isnull().sum()
#email has missing value

name           0
email          1
country        0
signup_date    0
dtype: int64

In [3]:
#orders dataset
orders

          user_id  order_date     status
order_id
1001            1  2024-03-10  Completed
1002            2  2024-03-11  Completed
1003            3  2024-03-12  Cancelled
1004            4  2024-03-13  Completed
1005            5  2024-03-14    Pending
1006            6  2024-03-15  Completed
1007            7  2024-03-16  Completed
1008            8  2024-03-17  Completed
1009            9  2024-03-18  Completed
1010           10  2024-03-19    Pending

In [61]:
#check for any missing order
orders.isnull().sum()
#no missing order value

user_id       0
order_date    0
status        0
dtype: int64

In [4]:
#ordered items dataset
order_items

               order_id  product_id  quantity
order_item_id
1                  1001         101         1
2                  1001         104         3
3                  1002         102         2
4                  1003         105         5
5                  1004         103         1
6                  1004         110         2
7                  1005         106         1
8                  1006         107         1
9                  1006         104        10
10                 1007         108         1

In [63]:
#check for any missing value in ordered items
order_items.isnull().sum()
#there is no missing value

order_id      0
product_id    0
quantity      0
dtype: int64

In [64]:
#payments dataset
payments

            order_id payment_method  amount_paid payment_date
payment_id
9001            1001    Credit Card         1215   2024-03-10
9002            1002         PayPal          300   2024-03-11
9003            1004    Credit Card          340   2024-03-13
9004            1006    Credit Card          320   2024-03-15
9005            1007     Debit Card          450   2024-03-16
9006            1008         PayPal          560   2024-03-17
9007            1009    Credit Card          600   2024-03-18
9008            1011     Debit Card          160   2024-03-20
9009            1012    Credit Card          120   2024-03-21
9010            1014         PayPal          180   2024-03-23

In [5]:
#check for any missing values in payments dataset
payments.isnull().sum()
#amount paid has missing values for 10 users

order_id          0
payment_method    0
amount_paid       0
payment_date      0
dtype: int64

In [6]:
users[users['email'].isna()]

               name email country signup_date
user_id
3        Mike Brown   NaN      UK  2024-02-01

In [7]:
#filter out valid emails
valid_emails=users[users['email'].notna()]
valid_emails[['email']]
valid_emails.reset_index(drop=True)
valid_emails.index=range(1,len(valid_emails)+1)
#filter out invalid emails
invalid_emails=users[users['email'].isna()]
print("Total email addresses: ",len(users))
print("Valid emails: ",len(valid_emails))
print("Invalid emails: ",len(invalid_emails))

Total email addresses:  10
Valid emails:  9
Invalid emails:  1

In [8]:
valid_emails[['email']]

                  email
1    john.doe@gmail.com
2  jane.smith@yahoo.com
3       alice@gmail.com
4     bob.lee@gmail.com
5       chris@gmail.com
6       linda@yahoo.com
7     sam.kim@gmail.com
8         raj@gmail.com
9       maria@yahoo.com

In [9]:
invalid_emails

               name email country signup_date
user_id
3        Mike Brown   NaN      UK  2024-02-01

In [70]:
#occurrence of country 
countries_count=users['country'].value_counts()
countries_count
#most users are from USA followed by UK

country
Kenya          2
USA            2
UK             2
Canada         1
South Korea    1
India          1
Spain          1
Name: count, dtype: int64

In [10]:
#check if there is missing country
country_missing=users[users['country'].isna()]
print("Country missing: ",len(country_missing))
#no country is missing

Country missing:  0

In [72]:
#check any missing_sign_up date
missing_signup=users[users['signup_date'].isna()]
print("Total signup dates missing: ",len(missing_signup))
#no missing signup dates

Total signup dates missing:  0

In [73]:
#check missing name
missing_name=users[users['name'].isna()]
print("Total names missing: ",len(missing_name))
#name missing names

Total names missing:  0

In [75]:
#check frequency of order status
orders_status_count=orders['status'].value_counts()
orders_status_count

status
Completed    7
Pending      2
Cancelled    1
Name: count, dtype: int64

In [76]:
orders

          user_id  order_date     status
order_id
1001            1  2024-03-10  Completed
1002            2  2024-03-11  Completed
1003            3  2024-03-12  Cancelled
1004            4  2024-03-13  Completed
1005            5  2024-03-14    Pending
1006            6  2024-03-15  Completed
1007            7  2024-03-16  Completed
1008            8  2024-03-17  Completed
1009            9  2024-03-18  Completed
1010           10  2024-03-19    Pending

In [77]:
order_items

               order_id  product_id  quantity
order_item_id
1                  1001         101         1
2                  1001         104         3
3                  1002         102         2
4                  1003         105         5
5                  1004         103         1
6                  1004         110         2
7                  1005         106         1
8                  1006         107         1
9                  1006         104        10
10                 1007         108         1

In [12]:
#merge orders with payments 
orders_payments=pd.merge(orders,payments,on="order_id",how="left")
orders_payments

,order_id,user_id,order_date,status,payment_method,amount_paid,payment_date
0,1001,1,2024-03-10,Completed,Credit Card,1215.0,2024-03-10
1,1002,2,2024-03-11,Completed,PayPal,300.0,2024-03-11
2,1003,3,2024-03-12,Cancelled,NaN,NaN,NaN
3,1004,4,2024-03-13,Completed,Credit Card,340.0,2024-03-13
4,1005,5,2024-03-14,Pending,NaN,NaN,NaN
5,1006,6,2024-03-15,Completed,Credit Card,320.0,2024-03-15
6,1007,7,2024-03-16,Completed,Debit Card,450.0,2024-03-16
7,1008,8,2024-03-17,Completed,PayPal,560.0,2024-03-17
8,1009,9,2024-03-18,Completed,Credit Card,600.0,2024-03-18
9,1010,10,2024-03-19,Pending,NaN,NaN,NaN

In [88]:
pending_or_cancelled = orders_payments[orders_payments["status"].isin(["Pending", "Cancelled"])].copy()
pending_or_cancelled

,order_id,user_id,order_date,status,payment_method,amount_paid,payment_date
2,1003,3,2024-03-12,Cancelled,NaN,NaN,NaN
4,1005,5,2024-03-14,Pending,NaN,NaN,NaN
9,1010,10,2024-03-19,Pending,NaN,NaN,NaN

In [13]:
#orders with complete payments only
orders_completed=(orders_payments.loc[orders_payments['status']=="Completed"].copy())
orders_completed

,order_id,user_id,order_date,status,payment_method,amount_paid,payment_date
0,1001,1,2024-03-10,Completed,Credit Card,1215.0,2024-03-10
1,1002,2,2024-03-11,Completed,PayPal,300.0,2024-03-11
3,1004,4,2024-03-13,Completed,Credit Card,340.0,2024-03-13
5,1006,6,2024-03-15,Completed,Credit Card,320.0,2024-03-15
6,1007,7,2024-03-16,Completed,Debit Card,450.0,2024-03-16
7,1008,8,2024-03-17,Completed,PayPal,560.0,2024-03-17
8,1009,9,2024-03-18,Completed,Credit Card,600.0,2024-03-18

In [79]:
#select status,payment_method and amount_paid
status_method=orders_payments.loc[:,["status","payment_method","amount_paid"]].copy()
status_method

      status payment_method  amount_paid
0  Completed    Credit Card       1215.0
1  Completed         PayPal        300.0
2  Cancelled            NaN          NaN
3  Completed    Credit Card        340.0
4    Pending            NaN          NaN
5  Completed    Credit Card        320.0
6  Completed     Debit Card        450.0
7  Completed         PayPal        560.0
8  Completed    Credit Card        600.0
9    Pending            NaN          NaN

In [14]:
#select only columns whose status is pending or cancelled
pending_or_cancelled=orders_payments[orders_payments["status"].isin(["Pending","Cancelled"])].copy()
pending_or_cancelled

,order_id,user_id,order_date,status,payment_method,amount_paid,payment_date
2,1003,3,2024-03-12,Cancelled,NaN,NaN,NaN
4,1005,5,2024-03-14,Pending,NaN,NaN,NaN
9,1010,10,2024-03-19,Pending,NaN,NaN,NaN

In [15]:
#loc uses row,column selection
#both methods below produce same results
A = orders_payments.loc[
    orders_payments["status"].isin(["Pending", "Cancelled"])
]

B = orders_payments.loc[
    orders_payments["status"].isin(["Pending", "Cancelled"]),
    :
]

A.equals(B)

True

In [16]:
#select order_id,status,payment_method and amount_paid
pending_or_cancelled_orders=orders_payments.loc[orders_payments["status"].isin(["Pending","Cancelled"]),["order_id","status","payment_method","amount_paid"]].copy()
pending_or_cancelled_orders

   order_id     status payment_method  amount_paid
2      1003  Cancelled            NaN          NaN
4      1005    Pending            NaN          NaN
9      1010    Pending            NaN          NaN

In [17]:
completed_cc = orders_payments.loc[
    (orders_payments["status"] == "Completed") &
    (orders_payments["payment_method"] == "Credit Card")
].copy()
completed_cc

,order_id,user_id,order_date,status,payment_method,amount_paid,payment_date
0,1001,1,2024-03-10,Completed,Credit Card,1215.0,2024-03-10
3,1004,4,2024-03-13,Completed,Credit Card,340.0,2024-03-13
5,1006,6,2024-03-15,Completed,Credit Card,320.0,2024-03-15
8,1009,9,2024-03-18,Completed,Credit Card,600.0,2024-03-18

In [18]:
credit_card_payments=orders_payments.loc[(orders_payments["status"]=="Completed")&(orders_payments["payment_method"]=="Credit Card")].copy()
credit_card_payments

,order_id,user_id,order_date,status,payment_method,amount_paid,payment_date
0,1001,1,2024-03-10,Completed,Credit Card,1215.0,2024-03-10
3,1004,4,2024-03-13,Completed,Credit Card,340.0,2024-03-13
5,1006,6,2024-03-15,Completed,Credit Card,320.0,2024-03-15
8,1009,9,2024-03-18,Completed,Credit Card,600.0,2024-03-18

In [103]:
#completed orders
completed_orders=orders_payments.loc[orders_payments["status"]=="Completed"].copy()
completed_orders

,order_id,user_id,order_date,status,payment_method,amount_paid,payment_date
0,1001,1,2024-03-10,Completed,Credit Card,1215.0,2024-03-10
1,1002,2,2024-03-11,Completed,PayPal,300.0,2024-03-11
3,1004,4,2024-03-13,Completed,Credit Card,340.0,2024-03-13
5,1006,6,2024-03-15,Completed,Credit Card,320.0,2024-03-15
6,1007,7,2024-03-16,Completed,Debit Card,450.0,2024-03-16
7,1008,8,2024-03-17,Completed,PayPal,560.0,2024-03-17
8,1009,9,2024-03-18,Completed,Credit Card,600.0,2024-03-18

In [20]:
#calculate total revenue
total_revenue=orders_completed["amount_paid"].sum()
print("Total revenue: ",total_revenue)

Total revenue:  3785.0

In [22]:
#count completed orders
completed_orders_count=orders_completed.shape[0]
print("Completed orders count: ",completed_orders_count)

Completed orders count:  7

In [23]:
#pending or cancelled orders count
pending_or_cancelled_count=pending_or_cancelled.shape[0]
print("Pending or cancelled orders count: ",pending_or_cancelled_count)

Pending or cancelled orders count:  3

In [112]:
#revenue by status
revenue_by_status=orders_payments.groupby("status")["amount_paid"].sum()
revenue_by_status

status
Cancelled       0.0
Completed    3785.0
Pending         0.0
Name: amount_paid, dtype: float64

In [24]:
#combine users with orders_payments table
users_orders_payments=pd.merge(users.copy(),orders_payments.copy(),on="user_id",how="left",indicator=True,validate="one_to_many")
users_orders_payments

,user_id,name,email,country,signup_date,order_id,order_date,status,payment_method,amount_paid,payment_date,_merge
0,1,John Doe,john.doe@gmail.com,Kenya,2024-01-05,1001,2024-03-10,Completed,Credit Card,1215.0,2024-03-10,both
1,2,Jane Smith,jane.smith@yahoo.com,USA,2024-01-12,1002,2024-03-11,Completed,PayPal,300.0,2024-03-11,both
2,3,Mike Brown,NaN,UK,2024-02-01,1003,2024-03-12,Cancelled,NaN,NaN,NaN,both
3,4,Alice Johnson,alice@gmail.com,Canada,2024-02-15,1004,2024-03-13,Completed,Credit Card,340.0,2024-03-13,both
4,5,Bob Lee,bob.lee@gmail.com,Kenya,2024-03-01,1005,2024-03-14,Pending,NaN,NaN,NaN,both
5,6,Chris Evans,chris@gmail.com,USA,2024-03-02,1006,2024-03-15,Completed,Credit Card,320.0,2024-03-15,both
6,7,Linda White,linda@yahoo.com,UK,2024-03-03,1007,2024-03-16,Completed,Debit Card,450.0,2024-03-16,both
7,8,Samuel Kim,sam.kim@gmail.com,South Korea,2024-03-05,1008,2024-03-17,Completed,PayPal,560.0,2024-03-17,both
8,9,Raj Patel,raj@gmail.com,India,2024-03-06,1009,2024-03-18,Completed,Credit Card,600.0,2024-03-18,both
9,10,Maria Lopez,maria@yahoo.com,Spain,2024-03-07,1010,2024-03-19,Pending,NaN,NaN,NaN,both

In [128]:
#aggregate revenue per user
revenue_per_user=users_orders_payments.groupby("name",as_index=False)["amount_paid"].sum()
revenue_per_user=revenue_per_user.sort_values(by="amount_paid",ascending=False)
revenue_per_user
#John Doe paid highest amount

            name  amount_paid
4       John Doe       1215.0
8      Raj Patel        600.0
9     Samuel Kim        560.0
5    Linda White        450.0
0  Alice Johnson        340.0
2    Chris Evans        320.0
3     Jane Smith        300.0
1        Bob Lee          0.0
6    Maria Lopez          0.0
7     Mike Brown          0.0

In [25]:
#group by name and country
#calculate total sales and average saless
sales_summary=(
    users_orders_payments
    .groupby(["name","country"],as_index=False)
    .agg(
        total_sales=("amount_paid","sum"),
        average_sales=("amount_paid","mean"))
    .sort_values(by="total_sales",ascending=False)
)
#fill empty fields ie NaN with 0 if no amount exist
sales_summary["average_sales"]=sales_summary["average_sales"].fillna(0)
sales_summary

            name      country  total_sales  average_sales
4       John Doe        Kenya       1215.0         1215.0
8      Raj Patel        India        600.0          600.0
9     Samuel Kim  South Korea        560.0          560.0
5    Linda White           UK        450.0          450.0
0  Alice Johnson       Canada        340.0          340.0
2    Chris Evans          USA        320.0          320.0
3     Jane Smith          USA        300.0          300.0
1        Bob Lee        Kenya          0.0            0.0
6    Maria Lopez        Spain          0.0            0.0
7     Mike Brown           UK          0.0            0.0

In [93]:
paypal_payments=orders_payments.loc[(orders_payments["status"]=="Completed")&(orders_payments["payment_method"]=="PayPal")].copy()
paypal_payments

,order_id,user_id,order_date,status,payment_method,amount_paid,payment_date
1,1002,2,2024-03-11,Completed,PayPal,300.0,2024-03-11
7,1008,8,2024-03-17,Completed,PayPal,560.0,2024-03-17

In [94]:
#fetch users who paid via Debit Card
debit_card_payments=orders_payments.loc[(orders_payments["status"]=="Completed")&(orders_payments["payment_method"]=="Debit Card")].copy()
debit_card_payments

,order_id,user_id,order_date,status,payment_method,amount_paid,payment_date
6,1007,7,2024-03-16,Completed,Debit Card,450.0,2024-03-16

In [95]:
sales_summary

            name      country  total_sales  average_sales
4       John Doe        Kenya       1215.0         1215.0
8      Raj Patel        India        600.0          600.0
9     Samuel Kim  South Korea        560.0          560.0
5    Linda White           UK        450.0          450.0
0  Alice Johnson       Canada        340.0          340.0
2    Chris Evans          USA        320.0          320.0
3     Jane Smith          USA        300.0          300.0
1        Bob Lee        Kenya          0.0            0.0
6    Maria Lopez        Spain          0.0            0.0
7     Mike Brown           UK          0.0            0.0

In [106]:
sales_per_country= pd.pivot_table(
    sales_summary,
    index="country",
    values=["total_sales", "average_sales"],
    aggfunc={"total_sales": "sum", "average_sales": "mean"}
)

sales_per_country=sales_per_country[["total_sales","average_sales"]]
sales_per_country

             total_sales  average_sales
country
Canada             340.0          340.0
India              600.0          600.0
Kenya             1215.0          607.5
South Korea        560.0          560.0
Spain                0.0            0.0
UK                 450.0          225.0
USA                620.0          310.0

In [107]:
print("Total revenue: ",sales_per_country["total_sales"].sum())

Total revenue:  3785.0

In [113]:
#convert to excel sheet ie one sheet
sales_per_country.reset_index().to_excel("sales_per_country.xlsx",sheet_name="Sales per country",index=False)

In [111]:
#convert to excel sheet with multiple sheets
sorted_by_total_sales=sales_per_country.sort_values(by="total_sales",ascending=False)
sorted_by_average_sales=sales_per_country.sort_values(by="average_sales",ascending=False)

In [141]:
#convert to excel
with pd.ExcelWriter("revenue_per_country.xlsx",engine="openpyxl") as writer:
    # print(writer.sheets)
    sales_per_country.reset_index().to_excel(writer,sheet_name="All countries",index=False)
    by_total_sales.reset_index().to_excel(writer,sheet_name="Sorted by Total sales",index=False)
    by_average_sales.reset_index().to_excel(writer,sheet_name="Sorted by Average sales",index=False)
    #add conditional highlighting
    highlight=PatternFill(
        start_color="0000FF00",
        end_color="0000FF00",
        fill_type="solid")
    for sheet_name in ["All countries","Sorted by Total sales","Sorted by Average sales"]:
        ws=writer.sheets[sheet_name]
        max_row=ws.max_row
        ws.conditional_formatting.add(f"B2:B{max_row}",FormulaRule(formula=[f"B2=MAX(B$2:B${max_row})"],fill=highlight))
        ws.conditional_formatting.add(f"C2:C{max_row}",FormulaRule(formula=[f"C2=MAX(C$2:C${max_row})"],fill=highlight))